{
	"major": [{
			"Economocis": {
				"courses": [{
					"ECON 10011": {
						"name": "Principles of Microeconomics",
						"prereqs": null,
						"coreqs": [],
						"credits": 3,
						"taken": false,
						"semReq": null,
						"semDefault": 1,
						"attributes": ["SOSC", "WKSS", "ZFYS"],
						"description": "An introduction to economics, with particular attention to the pricing mechanism, competitive and monopolistic markets, government regulation of the economy, labor-management relations and programs, income determination and public policy, trade and the international economy."
					},
					"ECON 10020": {
						"name": "Principles of MacroEconomics",
						"prereqs": ["ECON 10010", "ECON 10091", "ECON 10011", "ECON 20010", "ECON 20011"],
						"coreqs": [],
						"credits": 3,
						"taken": false,
						"semReq": null,
						"semDefault": 1,
						"attributes": ["SOSC", "WKSS", "ZFYS"],
						"description": "A continuation of introduction to economics with emphasis on the measurement of national economic performance, alternative explanations of short-run economic fluctuations and long-run economic growth, money and credit, fiscal and monetary policy."
					},
					"ECON 13181": {
						"name": "Social Science University Seminar",
						"prereqs": [],
						"coreqs": [],
						"credits": 3,
						"taken": false,
						"semReq": [1, 2],
						"semDefault": 1,
						"attributes": ["SOSC", "USEM", "WKSS"],
						"description": "Economics sections will deal with different aspects of economic analysis and policy issues. The focus will be on understanding how economists think about theoretical issues and how they apply their analytical tools to real-world economic problems and policies. No background in economics is assumed."
					}
				}]
			}
		}],
		"Film Television and Theatre": {
			"courses": [{
				"FTT 10101": {
					"name": "Basics of Film and Television",
					"prereqs": [],
					"coreqs": ["FTT 11101", "FTT 12101"],
					"credits": 3,
					"taken": false,
					"semReq": null,
					"semDefault": 1,
					"attributes": ["FNAR", "WKAR", "ZFYS"],
					"description": "This class is designed to enhance your understanding and appreciation of film and television. It operates on the philosophy that the better we understand how film and television texts work, the more intelligently and perceptively we will be able to consume them, which is an invaluable skill to have in our media-saturated world. You will learn about the basic elements that distinguish films and television programs from other aesthetic forms, such as editing, cinematography, sound and set design, and how these components work together to develop stories and characters. We will also work with interpretive frameworks that uncover deeper meanings and patterns in film and television, such as genre theory, the idea of authorship, political economy, and ideological analysis. Finally, you will acquire the skills and tools needed to write your own educated analyses of film and television texts. The class screenings present a range of films, from Hollywood classics to independent and international films, as well as television shows both old and new. This course is required for all concentrators in Film and Television."
				},
				"FTT 11101": {
					"name": "Basics/Film & Television Lab",
					"prereqs": [],
					"coreqs": ["FTT 10101"],
					"credits": 3,
					"taken": false,
					"semReq": null,
					"semDefault": 1,
					"attributes": [],
					"description": "During the lab times, certain films will be viewed for further discussion in class."
				}
			}]
		}

}